{
  "backend/main.mo": "Motoko canister managing user profiles and score submissions with access control and leaderboard sorting.",
  "feature_evidence.json": "JSON report mapping implemented features to corresponding frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing key frontend audio, ads, and styling files.",
  "frontend/index.css": "Tailwind base stylesheet defining light and dark theme variables using OKLCH color values.",
  "frontend/index.html": "Main HTML entry that loads the React app via root div and main.tsx.",
  "frontend/src/App.tsx": "Top-level React component managing screen navigation, audio, authentication, and profile setup flow.",
  "frontend/src/audio/AudioManager.ts": "Audio controller handling SFX playback and music settings using the Web Audio API.",
  "frontend/src/auth/LoginButton.tsx": "Login/logout button component wired to Internet Identity and React Query cache clearing.",
  "frontend/src/auth/ProfileSetupDialog.tsx": "Modal dialog allowing new users to submit a display name and save their profile.",
  "frontend/src/auth/useProfileSetup.ts": "Hook determining if the profile setup dialog should be shown based on authentication and profile state.",
  "frontend/src/game/assetLoader.ts": "Loads image assets asynchronously and returns them as a structured object.",
  "frontend/src/game/assets.ts": "Defines file paths for all game image assets.",
  "frontend/src/game/collision.ts": "Performs padded AABB collision detection between the player and obstacles.",
  "frontend/src/game/constants.ts": "Holds global constants for canvas size, physics, speeds, obstacle settings, scoring, and animation.",
  "frontend/src/game/GameHUD.tsx": "HUD component showing the current score and providing an on‑screen jump button.",
  "frontend/src/game/GameRenderer.ts": "Canvas renderer handling background parallax, ground tiling, player animations, and obstacle drawing.",
  "frontend/src/game/GameView.tsx": "React component initializing assets, game loop, rendering, input handling, and HUD display.",
  "frontend/src/game/obstacles.ts": "Contains logic for obstacle spawn timing, obstacle creation, and updating obstacle positions.",
  "frontend/src/game/physics.ts": "Handles gravity updates and jump initiation for the player.",
  "frontend/src/game/runnerLoop.ts": "Main game loop updating physics, spawning obstacles, scoring, and detecting collisions.",
  "frontend/src/game/types.ts": "Defines TypeScript interfaces for player, obstacles, game state, and game status.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor tied to Internet Identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for Internet Identity login, state management, and persistence.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and updating user profiles, scores, and leaderboard data through the actor API.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light and dark themes with an amber-focused palette.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/rewardedAds/useRewardedContinue.ts": "Manages state for showing a rewarded ad and controlling whether the player can continue.",
  "frontend/src/screens/GameOverScreen.tsx": "Displays the game over UI, handles score submission, best score display, and offers restart, menu, and ad-based continue options.",
  "frontend/src/screens/LeaderboardScreen.tsx": "Shows the top scores leaderboard, highlights the current user, and displays the user's best score if logged in.",
  "frontend/src/screens/MainMenuScreen.tsx": "Renders the main menu with start, leaderboard, settings, and login/logout options using Internet Identity.",
  "frontend/src/screens/RewardedAdModal.tsx": "Simulates a rewarded ad with a countdown and progress bar before triggering continuation.",
  "frontend/src/screens/SettingsScreen.tsx": "Provides toggles for music and sound effects, syncing settings with the audio manager and local storage.",
  "frontend/src/settings/storage.ts": "Handles loading and saving user settings to localStorage with default fallbacks.",
  "frontend/src/settings/useSettings.ts": "React hook that loads, updates, and persists user settings.",
  "frontend/src/ui/ScreenLayout.tsx": "Wraps screens with a gradient background and fixed footer including a caffeinated attribution link.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), persist them in sessionStorage, and clear them from the URL or storage.",
  "frontend/tailwind.config.js": "TailwindCSS config extending colors, radius, shadows, animations, and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Describes the project’s versioned state and features for an Android endless runner game, including architecture notes, assets, and implemented requirements."
}